app/controllers/books_controller.rb

  def index
    q = params[:q]

    if q.nil? or q == ''
      @books = Book.all
---
SELECT `books`.* FROM `books` WHERE `books`.`name like ?` = '%cendnqw%'

  def create
    data = parse_body request
    @book = Book.new(data)

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`author`, `created_at`, `name`, `status`, `updated_at`) VALUES ('Sourabh', '2013-04-29 10:23:40', 'A book', 'not read', '2013-04-29 10:23:40')

  def update
    @book = Book.find(params[:id])
    data = parse_body request

    respond_to do |format|
      if @book.update_attributes(data.reject {|key,_| key == :id or key == :updated_at or key == :created_at})
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 15 LIMIT 1
UPDATE `books` SET `status` = 'NOT_YET_READ', `updated_at` = '2013-04-29 16:47:00' WHERE `books`.`id` = 20